[{"combatFactors":{"rangedCombat":{"shooting":0,"shotAt":3},"closeCombat":{"vsFoot":2,"vsMounted":3}},"permanentCode":"BLV","displayName":"Bow Levy","displayCode":"BL","cost":2,"category":"foot","order":"Open","description":"Poorly trained infantry with long-distance missile weapons, untrained in volley fire, and smaller supplies of ammunition. Their long-range fire is weak and ineffective, and they would only use their relatively scarce supply of arrows when an enemy was quite close.  Examples are Elamite massed bowmen, Sicilio-Norman Saracen foot bow, and a wide variety of Biblical and Medieval massed archers without confidence or much training.","importName":"Bow Levy","id":"5fb1b6f2e1af0600177018ec"},{"combatFactors":{"rangedCombat":{"shooting":0,"shotAt":2},"closeCombat":{"vsFoot":2,"vsMounted":1}},"permanentCode":"RBL","displayName":"Rabble","displayCode":"Rb","cost":2,"category":"foot","order":"Open","description":"Poorly-trained or poorly armed infantry fighting in loose order. Effective enough in bad going, where their native loose order is no disadvantage, but badly outmatched fighting in the open against, well, almost anything. Examples include armed mobs, unshielded peasants throwing rocks or javelins, Libyan hordes, and the like.","importName":"Rabble","id":"5fb1b6f2e1af0600177018ed"},{"combatFactors":{"rangedCombat":{"shooting":0,"shotAt":2},"closeCombat":{"vsFoot":3,"vsMounted":2}},"permanentCode":"HRD","displayName":"Horde","displayCode":"Hd","cost":2,"category":"foot","order":"Close","description":"Poorly-trained or unwilling infantry fighting in close order. Can be effective in a limited way in the open, for a while. Examples are the great fyrd of the Anglo-Saxons, dikut mati emergency levy of the Neo-Sargonid Assyrians, or conscript infantry of the Sui Chinese million-man army.","importName":"Horde","id":"5fb1b6f2e1af0600177018ee"},{"combatFactors":{"rangedCombat":{"shooting":3,"shotAt":3},"closeCombat":{"vsFoot":2,"vsMounted":4}},"permanentCode":"ARC","displayName":"Archers","displayCode":"Arc","cost":4,"category":"foot","order":"Open","description":"Infantry armed with long-distance missile weapons, trained in volley fire, and supplied with large numbers of arrows, quarrels or darts.  Examples include Medieval bow and crossbowmen, English longbow, Nabataean archers, Chinese crossbow, Japanese samurai before the Sengoku-jidai, and many others.","importName":"Archer","id":"5fb1b6f2e1af0600177018ef"},{"combatFactors":{"rangedCombat":{"shooting":0,"shotAt":3},"closeCombat":{"vsFoot":3,"vsMounted":2}},"permanentCode":"LFT","displayName":"Light Foot","displayCode":"LFt","cost":3,"category":"foot","order":"Open","description":"Loose order infantry with javelins, shields and a melee weapon, whether a stabbing spear or sword or other weapon. Loose order makes them weak against mounted, but excellent combatants in bad terrain. Examples are innumerable, but include Thracians, Irish kerns, Ancient Spanish, and Burmese foot.","importName":"Light Foot","id":"5fb1b6f2e1af0600177018f0"},{"combatFactors":{"rangedCombat":{"shooting":0,"shotAt":3},"closeCombat":{"vsFoot":3,"vsMounted":3}},"permanentCode":"LSP","displayName":"Light Spear","displayCode":"LSp","cost":3,"category":"foot","order":"Open","description":"Loose order foot armed with long spears but no shields; capable of fighting in bad terrain but also fighting against mounted in the open when necessary. Examples include Medieval North Welsh foot, Mountain Indians, Ghurids, Frisian spearmen, or Hittite spear.","importName":"Light Spear","id":"5fb1b6f2e1af0600177018f1"},{"combatFactors":{"rangedCombat":{"shooting":0,"shotAt":3},"closeCombat":{"vsFoot":4,"vsMounted":2}},"permanentCode":"RDR","displayName":"Raiders","displayCode":"Rd","cost":4,"category":"foot","order":"Open","description":"Fast melee infantry who are better armed and trained and more willing to fight in close combat (with fewer javelins and throwing weapons) than Light Foot, and faster and better in bad going than Heavy or Elite Foot. Examples include Hellenistic thureophoroi and thorakitaii, Early Imperial Roman auxilia, Medieval Spanish sword-and-buckler men, Chinese “dare to die” troops, and early Viking raiders.","importName":"Raider","id":"5fb1b6f2e1af0600177018f2"},{"combatFactors":{"rangedCombat":{"shooting":0,"shotAt":3},"closeCombat":{"vsFoot":2,"vsMounted":1}},"permanentCode":"SKM","displayName":"Skirmishers","displayCode":"Sk","cost":3,"category":"foot","order":"Open","description":"Loose order troops with long-range missile weapons, but used as individuals (not volley fire) and at short ranges (as close as can be done without personal risk), and with relatively limited ammo supplies. Effective irritants against enemy heavy foot and similar melee-focused infantry where their response of fleeing when overmatched and then regrouping and returning makes for a frustrating battle without good result for the heavy foot. Examples are Balearic slingers, Cretan archers, Medieval handgunners, and so on.","importName":"Skirmisher","id":"5fb1b6f2e1af0600177018f3"},{"combatFactors":{"rangedCombat":{"shooting":0,"shotAt":3},"closeCombat":{"vsFoot":3,"vsMounted":2}},"permanentCode":"WBD","displayName":"Warband","displayCode":"Wb","cost":3,"category":"foot","order":"Open","description":"Infantry closely related to Warrior in ability and function, but fighting in looser order. This makes them faster and less inhibited by terrain, but less capable in dense formations in the open. Examples include Ancient British, Dark Ages Welsh, some Early German tribes (Batavi and Cherusci in particular), Caledonians, Early Vandals, or early Tamil Indians.","importName":"Warband","id":"5fb1b6f2e1af0600177018f4"},{"combatFactors":{"rangedCombat":{"shooting":4,"shotAt":3},"closeCombat":{"vsFoot":2,"vsMounted":2}},"permanentCode":"ART","displayName":"Artillery","displayCode":"Art","cost":3,"category":"foot","order":"Close","description":"Battlefield artillery, whether stone-throwing (often portable counterweight models crewed by men pulling ropes, a technique used for thousands of years), bolt-throwing, or early gunpowder weapons. Much longer effective range than anything else on the battlefield, but with a slow reload time they were vulnerable to any enemy group that could get to them. Armies that used artillery include Romans, Alexander the Great, Byzantines, Mongols, and many Medieval armies.","importName":"Artillery","id":"5fb1b6f2e1af0600177018f5"},{"combatFactors":{"rangedCombat":{"shooting":0,"shotAt":3},"closeCombat":{"vsFoot":5,"vsMounted":3}},"permanentCode":"EFT","displayName":"Elite Foot","displayCode":"EFt","cost":4,"category":"foot","order":"Close","description":"Close-order foot specialized and experienced in fighting against enemy foot, with armor and effective melee weapons. Examples include Spartan and Theban hoplites, Roman legionaries, dismounted Medieval knights, Viking huscarles, armored men with bill or halberd, and the like.","importName":"Elite Foot","id":"5fb1b6f2e1af0600177018f6"},{"combatFactors":{"rangedCombat":{"shooting":0,"shotAt":3},"closeCombat":{"vsFoot":4,"vsMounted":3}},"permanentCode":"HFT","displayName":"Heavy Foot","displayCode":"HFt","cost":3,"category":"foot","order":"Close","description":"Heavy foot with shields, melee weapons, and sometimes armor fighting in close order but without specific experience or weapons for resisting enemy mounted troops. Effective combatants in good going, especially against infantry. Examples include Anglo-Danes, poorer quality Roman legionaries (especially raw, mutinous, or recently recruited legions), and many Medieval town militias.","importName":"Heavy Foot","id":"5fb1b6f2e1af0600177018f7"},{"combatFactors":{"rangedCombat":{"shooting":3,"shotAt":3},"closeCombat":{"vsFoot":3,"vsMounted":4}},"permanentCode":"PAV","displayName":"Pavisiers","displayCode":"Pv","cost":4,"category":"foot","order":"Close","description":"A combination formation where a large body of long-distance missile troops are stiffened with a few front ranks of spear or pike, often with the large shield called (in the Middle Ages) a pavise, or similar. As such the formation retained the long-range missile capability of Archers, but with greater ability to hold off enemy mounted and foot. These formations were effective in good going, but performed poorly when the thin front ranks were unable to maintain close formation in bad terrain. Examples are Byzantine kontaratoi, Achaemenid Persian sparabara and the Babylonian formations they inherited from, many formations of the Chinese Warring States period, and Italian Medieval pavisiers.","importName":"Pavise","id":"5fb1b6f2e1af0600177018f8"},{"combatFactors":{"rangedCombat":{"shooting":0,"shotAt":3},"closeCombat":{"vsFoot":3,"vsMounted":4}},"permanentCode":"PIK","displayName":"Pikes","displayCode":"Pk","cost":3,"category":"foot","order":"Close","description":"Super-long spears used by men fighting in deep formations, allowing multiple ranks of soldiers to fight in a very limited area. This makes them by far the most effective troops in the open when their flanks are secure, but vulnerable to attacks from the flanks (even more than normal troops) and poor in bad going. Examples are Macedonian phalangites, Low Countries pikes, Scots schiltrons, Swiss pikemen, and many more.","importName":"Pike","id":"5fb1b6f2e1af0600177018f9"},{"combatFactors":{"rangedCombat":{"shooting":0,"shotAt":3},"closeCombat":{"vsFoot":4,"vsMounted":4}},"permanentCode":"SPR","displayName":"Spear","displayCode":"Sp","cost":4,"category":"foot","order":"Close","description":"Close-order foot fighting with long spears in a static formation specifically adopted to resist mounted enemies. Spears as a primary weapon are insufficient evidence (taken alone) to classify troop types as “Spear,” as every troop type includes foot fighting with a spear among its various historical examples. Examples include Rus, and many Medieval spearmen, but not Anglo-Danes or Vikings who fought with shorter spears and had little or no experience resisting mounted foes.","importName":"Spear","id":"5fb1b6f2e1af0600177018fa"},{"combatFactors":{"rangedCombat":{"shooting":3,"shotAt":4},"closeCombat":{"vsFoot":3,"vsMounted":4}},"permanentCode":"WWG","displayName":"War Wagons","displayCode":"WWg","cost":3,"category":"foot","order":"Close","description":"Portable fortified wagons with missile-armed crew and often light guns. Wagons were used as camp fortifications throughout history, but armies are only allowed war wagons as an element type when they were known to use the wagons in a mobile way during a battle, often as flank guards. Good examples of war wagons are the Hussites and Pechenegs.","importName":"Warwagon","id":"5fb1b6f2e1af0600177018fb"},{"combatFactors":{"rangedCombat":{"shooting":0,"shotAt":3},"closeCombat":{"vsFoot":3,"vsMounted":2}},"permanentCode":"WRR","displayName":"Warriors","displayCode":"Wr","cost":3,"category":"foot","order":"Close","description":"Infantry relying on a fierce initial charge that can shatter close-order infantry. Their reliance on individual and group aggression means their attack peters out quickly if the enemy survives their initial charge. Warband is a closely related type, with Warrior preferring to fight in tighter formed units in the open. Examples include Gallic and Galatian foot, some Early German tribes, Saxons, Franks, Visigoths, Sumatrans, and others.","importName":"Warrior","id":"5fb1b6f2e1af0600177018fc"},{"combatFactors":{"rangedCombat":{"shooting":0,"shotAt":2},"closeCombat":{"vsFoot":2,"vsMounted":2}},"permanentCode":"BAD","displayName":"Bad Horse","displayCode":"BH","cost":3,"category":"mounted","order":"Open","description":"Mounted missile troops with very slow reload rates and unwilling or incapable of sustained melee fighting, or other examples of poor or ineffective horse primarily useful for their mobility, not their striking power (against anything). Examples are Medieval mounted crossbow, Assyrian pethalle paired mounted archers, Anglo-Dane huscarles attempting to fight while mounted, late Byzantine poor-quality Stratiotai, Roman Equites Cohortales, poor Chinese cavalry, etc.","importName":"Bad Horse","id":"5fb1b6f2e1af0600177018fd"},{"combatFactors":{"rangedCombat":{"shooting":0,"shotAt":2},"closeCombat":{"vsFoot":2,"vsMounted":2}},"permanentCode":"BTX","displayName":"Battle Taxi","displayCode":"BTx","cost":3,"category":"mounted","order":"Open","description":"The other major path in chariot development, where chariots were used as transportation methods for elite warriors who would ride to battle, dismount individually (not as a group) to fight on foot, then get picked up again by their drivers to swoop somewhere else. Also used for any chariots who were crewed completely by crew armed with javelins and melee weapons, who necessarily would need to get to thrown-weapon range against any foe even if they did not dismount. Examples are Trojans and Achaeans, later Mycenaeans, Gallic and Early Romans, and a variety of cultures in the British Isles. They were outmatched by cavalry or bow-armed chariots, but stayed in use for a long time where such technology was not available or did not spread quickly, and were only abandoned in the Dark Ages in Scotland and Ireland.","importName":"Battle Taxi","id":"5fb1b6f2e1af0600177018fe"},{"combatFactors":{"rangedCombat":{"shooting":0,"shotAt":3},"closeCombat":{"vsFoot":2,"vsMounted":3}},"permanentCode":"CHT","displayName":"Chariots","displayCode":"Ch","cost":4,"category":"mounted","order":"Open","description":"All chariots with bow-armed crew and plentiful ammunition; also other chariots equipped with very long weapons like early Mycenaeans and some Chinese armies who remained in a moving chariot to fight. The premier mounted arm from the first development of the technology around 1600 BC until the development of large quantities of capable foot and the availability of much cheaper effective mounted arms with larger horses overtook them around the 6th through 4th century BC in the Middle East and after 200 BC in China. Examples include Egyptian, Assyrian, Classical Indian, and Warring States Chinese chariots.","importName":"Chariot","id":"5fb1b6f2e1af0600177018ff"},{"combatFactors":{"rangedCombat":{"shooting":0,"shotAt":3},"closeCombat":{"vsFoot":3,"vsMounted":3}},"permanentCode":"ECV","displayName":"Elite Cavalry","displayCode":"ECv","cost":4,"category":"mounted","order":"Open","description":"Cavalry equipped with bow and lance, equipped and trained to fight in melee or with short-range missile fire. Many elite cavalry elements were also equipped with horse armor or barding. Examples are Mamluk and Ottoman heavy cavalry, Mongol heavy cavalry, Sassanid Asavaran, and Timurid heavy cavalry.","importName":"Elite Cavalry","id":"5fb1b6f2e1af060017701900"},{"combatFactors":{"rangedCombat":{"shooting":0,"shotAt":2},"closeCombat":{"vsFoot":2,"vsMounted":3}},"permanentCode":"HBW","displayName":"Horse Bow","displayCode":"HBw","cost":4,"category":"mounted","order":"Open","description":"Cavalry fighting with bows from horseback, usually with large ammo supplies. Effective against other horse; less effective against foot but at almost no risk from them because of the ability to engage from out of thrown-weapon range. Examples are Skythians, Huns, Magyars, most Mongols, and many more.","importName":"Horsebow","id":"5fb1b6f2e1af060017701901"},{"combatFactors":{"rangedCombat":{"shooting":0,"shotAt":2},"closeCombat":{"vsFoot":3,"vsMounted":2}},"permanentCode":"JCV","displayName":"Javelin Cavalry","displayCode":"JCv","cost":4,"category":"mounted","order":"Open","description":"Cavalry fighting with javelins from horseback. Forced to get into thrown-weapon range to engage foes, which make them more effective against foot but also at more risk from them. Outmatched by any mounted using bows due to range and ammo limitations. At grave risk from Knights, but often effective in bringing them into a charge too deep into a foe where they can be swarmed or attacked when dispersed or tired. Examples include Andalusian and Spanish jinetes, various Saracen and Arab light cavalry, and many Greek, Roman, and Gallic horsemen before the advent of the Huns.","importName":"JavCav","id":"5fb1b6f2e1af060017701902"},{"combatFactors":{"rangedCombat":{"shooting":0,"shotAt":2},"closeCombat":{"vsFoot":3,"vsMounted":4}},"permanentCode":"KNT","displayName":"Knights","displayCode":"Kn","cost":4,"category":"mounted","order":"Open","description":"Charging cavalry who attempt at all costs to get into melee with the foe and sweep away enemies by the force of their charge. Examples including Macedonian Companions, Sarmatians, Goths and many Dark Ages Germanic cavalry, Xystophoroi, Norman Knights, and the major mounted component of most Western European medieval armies.","importName":"Knight","id":"5fb1b6f2e1af060017701903"},{"combatFactors":{"rangedCombat":{"shooting":0,"shotAt":3},"closeCombat":{"vsFoot":4,"vsMounted":4}},"permanentCode":"CAT","displayName":"Cataphracts","displayCode":"Cat","cost":4,"category":"mounted","order":"Close","description":"Heavily armored cavalry (man and horse) who fight exclusively in melee but do not rely on the force of a dangerous and ferocious initial charge to create victory. Examples are catafractii and clibanarii from Parthian to Late Romans, some kataphraktoi of the Byzantines, and some deep-formation knights of the Holy Roman Empire in the late Medieval period.","importName":"Cataphract","id":"5fb1b6f2e1af060017701904"},{"combatFactors":{"rangedCombat":{"shooting":0,"shotAt":3},"closeCombat":{"vsFoot":5,"vsMounted":4}},"permanentCode":"ELE","displayName":"Elephants","displayCode":"El","cost":4,"category":"mounted","order":"Close","description":"Elephants trained and used massed in warfare, with a variety of crews and possible escorting attached light infantry. The Asian elephant and African forest elephant were domesticated and used this way; the larger African bush elephant was never domesticated. This was the premier arm of warfare in India and South-East Asia for a very long time, and a very important part of war in the eastern and southern Mediterranean from the initial spread of the technology through Alexander’s successors until the failure of Carthage, Pyrrhus, and the Seleucids to cope with the rise of Rome.","importName":"Elephant","id":"5fb1b6f2e1af060017701905"}]